Revit 2027 API
DividedPath.Distance Property
 The distance between points that are distributed along the path according to the selected layout. When the layout is set to 'FixedDistance' this value can be set to desired distance. The measurement type determines how the distance is measured.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Distance { get; set; }
Public Property Distance As Double
	Get
	Set
public:
property double Distance {
	double get ();
	void set (double value);
}
member Distance : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The distance is too small.
InvalidOperationException |  When setting this property: The distance can only be set when the layout of this DividedPath is set to 'FixedDistance' or 'None'.
Remarks
 This does not take into account points obtained by intersections with other elements. When the layout is set to 'None' the distance is the value that would be used by the 'FixedDistance' layout.
See Also
Reference
DividedPath Class
Autodesk.Revit.DB Namespace